from entity import *
from scene import *
from nine_ai import *
# from shopowner_ai import *
import random
def mapGener(nowmp):
    nowmp.style=0
    def genWall(x,y,iid):
        nowmp.mp[x][y]["type"]="wall"
        nowmp.mp[x][y]["render"]=myImage(f'./assets/scene/wall{nowmp.style}.{iid}.png')
    def genObject(x,y,iid):
        nowmp.mp[x][y]["type"]="object"
        nowmp.mp[x][y]["content"]=iid
        nowmp.mp[x][y]["render"]=myImage(f'./assets/scene/object{iid}.png')
    def genObstacle(x,y,iid):
        nowmp.mp[x][y]["type"]="obstacle"
        nowmp.mp[x][y]["content"]=iid
        nowmp.mp[x][y]["render"]=myImage(f'./assets/scene/obstacle{nowmp.style}.{iid}.png')
    def genField(x,y):
        nowmp.mp[x][y]["type"]="field"
        nowmp.mp[x][y]["content"]=0
        nowmp.mp[x][y]["render"]=None
    nowmp.C=41
    nowmp.R=31

    for x,y in scene0:
        i = random.randrange(1,13)
        genWall(x-1,y-1,i)
    for x in range(0, 41):
        for y in range(0, 31):
            if nowmp.mp[x][y]["type"]=='field' and random.randrange(1,9)>1:
                i = random.randrange(1,12)
                genObstacle(x,y,i)
    genField(0,28)#后面改成通道
    genField(40,2)

    genField(1,27)#空地保证游玩正常
    genField(1,28);genField(1,29);genField(2,28)
    genField(39,1);genField(39,2);genField(39,3);genField(38,2)

    # monster
    genField(5,23);genField(6,23);genField(7,23);genField(8,23)
    nowmp.addMonster(6,23,"./assets/monster/")

    nowmp.mp[0][28]["teleportTo"]=(1,40,11)

def mapGenerTown(nowmp):
    nowmp.style=1
    nowmp.C=41
    nowmp.R=31
    nowmp.backGround=myImage(f'./assets/scene/scene{nowmp.style}.png',zoom=nowmp.C)
    # 进入田野
    nowmp.mp[40][12]["teleportTo"]=(0,1,28)
    #进入商店
    nowmp.mp[23][25]["teleportTo"]=nowmp.mp[24][25]["teleportTo"]=\
        nowmp.mp[25][25]["teleportTo"]=(2,5,14)
    nowmp.mp[23][25]["content"]=nowmp.mp[24][25]["content"]=\
        nowmp.mp[25][25]["content"]=-1 #按f才能进入
    # nowmp.fieldimg=myImage(f'./assets/scene/transparent.png') # useless
    # interact point:
    def testInteract():
        pass
    def icecreamShop():
        while True:
            t=""
            for c in zote_precepts:
                t= yield c+str(t) # yield要输出的对话，由imageclass.py中的dialog.keyboard处理
                # 在存在llm时yield的返回值(t)为用户输入
            yield None # None为特殊占位符，表示对话结束

            
        ''' 
        while True:
            pygame.time.Clock().tick(c.FPS)
            for event in pygame.event.get():
                if event.type == pygame.QUIT:
                    pygame.quit()
                    sys.exit()
            keys = pygame.key.get_pressed()
            if keys[pygame.K_ESCAPE]: break
            drawDialog("upcoming soon",win)
            pygame.display.update()
        '''
    def dogtalk():
        while True:
            yield "Woof!"
            yield None
    def nineNineCat():
        c=nine('')
        while True:
            t = yield c 
            c= nine(str(t))
            # if t == None:
            #     break
        yield None
    def RefuseEnter():
        while True:
            yield "私人住宅，谢绝参观"
            yield None
    def EnterShop(me,mapper):
        pass

    nowmp.mp[34][11]["interact"]=(icecreamShop(),False)
    nowmp.mp[28][25]["interact"]=nowmp.mp[29][25]["interact"]=(dogtalk(),False)
    nowmp.mp[14][25]["interact"]=nowmp.mp[21][6]["interact"]=nowmp.mp[30][6]["interact"]=(RefuseEnter(),False)
    nowmp.mp[11][6]["interact"]=(nineNineCat(),True)
    # 23 25/24 25/25 25 进入商店
    # 3 16 自家房门
    def genWall(x,y):
        nowmp.mp[x][y]["type"]="wall"
    for x,y in scene1:
        genWall(x,y)

def mapGenerShop(nowmp):
    nowmp.style=2
    nowmp.C=21;nowmp.R=17
    nowmp.backGround=myImage(f'./assets/scene/scene{nowmp.style}2.png',zoom=nowmp.C)
    nowmp.mp[5][15]["teleportTo"]=(1,24,25)
    def getPrice():
        return [10,10,10,10,10]
    def sale(nowplayer,_):
        # nowplayer.money+=100
        while True:
            price=getPrice()
            t=yield f"On Sale: 1: Heal Potion (${price[0]}), 2: Sensitive Potion(${price[1]}), 3: Expanded Bomb Grid Potion(${price[2]}), and 4: Kicking Bomb Boots(${price[3]}). your coin: {nowplayer.money}"
            tcoin=nowplayer.money
            if "heal" in t and nowplayer.money>price[0] :
                nowplayer.hp+=1;nowplayer.money-=price[0]
            if "expanded" in t and nowplayer.money>price[2] :
                nowplayer.bombRange+=1;nowplayer.money-=price[2]
            if "sensitive" in t and nowplayer.money>price[1]:
                nowplayer.speed=c.IncreasedSpeed;nowplayer.money-=price[1]
            if ("kicking" in t or "boots" in t) and nowplayer.money>price[3]:
                nowplayer.cankick=True;nowplayer.money-=price[3]
            if tcoin<nowplayer.money:
                yield "purchase succeed"
            elif "heal" in t or "expanded" in t or "sensitive" in t or "kicking" in t or "boots" in t:
                yield "purchase failed, maybe money isn't enough?"
            else : yield "Product not found"
    def shopownertalk():
        c=nine('')
        while True:
            t = yield c 
            c= nine(str(t))
            # if t == None:
            #     break
        yield None
    nowmp.mp[4][5]["interact"]=(sale,True)
    nowmp.mp[2][5]["interact"]=nowmp.mp[3][5]["interact"]=(shopownertalk(),True)

    nowmp.mp[9][5]["type"]="wall"
    nowmp.mp[9][5]["render"]=myImage(f'./assets/scene/shelf1.png',zoom=6)
    
    nowmp.mp[9][8]["type"]="wall"
    nowmp.mp[9][8]["render"]=myImage(f'./assets/scene/shelf1.png',zoom=6)
    
scene0 = [
[1,1],[1,2],[1,3],[1,4],[1,5],[1,6],[1,7],[1,8],[1,9],[1,10],[1,11],[1,12],[1,13],[1,14],[1,15],[1,16],[1,17],[1,18],[1,19],[1,20],[1,21],[1,22],[1,23],[1,24],[1,25],[1,26],[1,27],[1,28],[1,30],[1,31],
[41,1],[41,2],[41,4],[41,5],[41,6],[41,7],[41,8],[41,9],[41,10],[41,11],[41,12],[41,13],[41,14],[41,15],[41,16],[41,17],[41,18],[41,19],[41,20],[41,21],[41,22],[41,23],[41,24],[41,25],[41,26],[41,27],[41,28],[41,29],[41,30],[41,31],
[2,1],[3,1],[4,1],[5,1],[6,1],[7,1],[8,1],[9,1],[10,1],[11,1],[12,1],[13,1],[14,1],[15,1],[16,1],[17,1],[18,1],[19,1],[20,1],[21,1],[22,1],[23,1],[24,1],[25,1],[26,1],[27,1],[28,1],[29,1],[30,1],[31,1],[32,1],[33,1],[34,1],[35,1],[36,1],[37,1],[38,1],[39,1],[40,1],
[2,31],[3,31],[4,31],[5,31],[6,31],[7,31],[8,31],[9,31],[10,31],[11,31],[12,31],[13,31],[14,31],[15,31],[16,31],[17,31],[18,31],[19,31],[20,31],[21,31],[22,31],[23,31],[24,31],[25,31],[26,31],[27,31],[28,31],[29,31],[30,31],[31,31],[32,31],[33,31],[34,31],[35,31],[36,31],[37,31],[38,31],[39,31],[40,31],
[2,6],
[3,2],[3,3],[3,5],[3,6],[3,7],[3,9],[3,10],[3,11],[3,13],[3,14],[3,15],[3,17],[3,18],[3,19],[3,21],[3,22],[3,23],[3,25],[3,27],[3,28],[3,30],
[4,7],[4,13],[4,17],
[5,2],[5,4],[5,5],[5,7],[5,8],[5,9],[5,11],[5,12],[5,13],[5,15],[5,16],[5,17],[5,18],[5,19],[5,20],[5,21],[5,23],[5,25],[5,26],[5,27],[5,28],[5,29],
[6,9],[6,17],[6,27],
[7,2],[7,3],[7,4],[7,5],[7,7],[7,8],[7,9],[7,10],[7,11],[7,12],[7,13],[7,15],[7,16],[7,17],[7,18],[7,19],[7,20],[7,21],[7,22],[7,23],[7,25],[7,28],[7,29],
[8,5],[8,11],[8,21],[8,25],[8,27],
[9,2],[9,3],[9,5],[9,7],[9,9],[9,11],[9,13],[9,15],[9,17],[9,19],[9,20],[9,21],[9,23],[9,25],[9,26],[9,27],[9,29],[9,30],
[10,7],[10,13],[10,17],[10,27],
[11,3],[11,5],[11,6],[11,7],[11,8],[11,10],[11,11],[11,13],[11,15],[11,16],[11,17],[11,19],[11,21],[11,22],[11,23],[11,25],[11,27],[11,28],[11,29],
[12,3],[12,13],[12,17],[12,23],
[13,3],[13,4],[13,6],[13,7],[13,8],[13,9],[13,10],[13,12],[13,13],[13,14],[13,15],[13,17],[13,19],[13,20],[13,21],[13,23],[13,24],[13,26],[13,27],[13,29],
[14,13],[14,17],[14,19],[14,27],
[15,3],[15,4],[15,5],[15,6],[15,7],[15,9],[15,11],[15,12],[15,13],[15,15],[15,16],[15,17],[15,19],[15,21],[15,22],[15,23],[15,25],[15,27],[15,29],[15,30],
[16,12],[16,24],
[17,3],[17,4],[17,5],[17,7],[17,8],[17,9],[17,11],[17,12],[17,13],[17,14],[17,15],[17,17],[17,18],[17,20],[17,21],[17,23],[17,24],[17,25],[17,26],[17,27],[17,28],[17,29],
[18,11],[18,17],[18,21],[18,25],
[19,2],[19,4],[19,5],[19,6],[19,7],[19,9],[19,10],[19,11],[19,13],[19,15],[19,16],[19,17],[19,19],[19,21],[19,22],[19,23],[19,25],[19,27],[19,28],[19,29],[19,30],
[20,13],[20,17],[20,23],
[21,3],[21,5],[21,6],[21,8],[21,9],[21,11],[21,12],[21,13],[21,15],[21,17],[21,19],[21,20],[21,21],[21,23],[21,24],[21,26],[21,27],[21,29],[21,30],
[22,9],[22,13],[22,19],[22,27],[23,2],[23,3],[23,5],[23,6],[23,7],[23,9],[23,10],[23,11],[23,13],[23,14],[23,15],[23,17],[23,18],[23,19],[23,20],[23,22],[23,23],[23,24],[23,25],[23,27],[23,29],[23,30],
[24,9],[24,13],[24,15],[24,23],[24,25],
[25,2],[25,4],[25,5],[25,7],[25,8],[25,11],[25,13],[25,15],[25,16],[25,18],[25,19],[25,21],[25,22],[25,23],[25,25],[25,27],[25,28],[25,29],[25,30],
[26,9],[26,13],
[27,3],[27,5],[27,6],[27,7],[27,10],[27,11],[27,13],[27,14],[27,15],[27,17],[27,18],[27,19],[27,21],[27,22],[27,23],[27,25],[27,27],[27,28],[27,29],
[28,3],[28,9],[28,17],
[29,2],[29,3],[29,5],[29,6],[29,8],[29,9],[29,11],[29,12],[29,13],[29,15],[29,16],[29,17],[29,19],[29,20],[29,22],[29,23],[29,24],[29,26],[29,28],[29,29],
[30,33],
[31,2],[31,3],[31,4],[31,5],[31,6],[31,8],[31,9],[31,10],[31,12],[31,13],[31,14],[31,15],[31,17],[31,19],[31,20],[31,21],[31,23],[31,25],[31,26],[31,27],[31,29],[31,30],
[32,9],[32,16],[32,27],[32,22],
[33,3],[33,5],[33,6],[33,7],[33,11],[33,12],[33,13],[33,15],[33,17],[33,18],[33,19],[33,20],[33,23],[33,24],[33,25],[33,3],[33,26],[33,27],[33,29],[33,30],
[34,3],[34,7],[34,9],[34,15],[34,17],
[35,2],[35,3],[35,5],[35,6],[35,7],[35,8],[35,9],[35,11],[35,13],[35,14],[35,15],[35,17],[35,19],[35,20],[35,22],[35,23],[35,25],[35,26],[35,28],[35,29],
[36,7],[36,9],[36,15],[36,17],[36,23],
[37,3],[37,4],[37,5],[37,7],[37,9],[37,11],[37,12],[37,13],[37,15],[37,16],[37,17],[37,18],[37,20],[37,21],[37,22],[37,23],[37,25],[37,26],[37,27],[37,29],[37,30],
[38,9],[38,13],[38,27],
[39,2],[39,4],[39,5],[39,6],[39,7],[39,9],[39,10],[39,11],[39,13],[39,15],[39,17],[39,19],[39,20],[39,21],[39,23],[39,24],[39,25],[39,27],[39,29],
[40,13],[40,15],[40,17],[40,21],[40,29]
]

scene1=[
[0,19],[1,19],[2,19],[3,19],[4,19],[5,19],[6,19],[7,19],[8,19],
[0,15],[1,15],[2,15],[3,15],[4,15],[5,15],[6,15],[7,15],[8,15],
[8,20],[8,21],[8,22],[8,23],[8,24],[8,25],[8,26],[8,27],
[9,27],[10,27],[11,27],[12,27],[13,27],[14,27],[15,27],[16,27],[17,27],[18,27],[19,27],[20,27],[21,27],[22,27],[23,27],[24,27],[25,27],[26,27],[27,27],[28,27],[29,27],[30,27],[31,27],
[31,13],[31,14],[31,15],[31,16],[31,17],[31,18],[31,19],[31,20],[31,21],[31,22],[31,23],[31,24],[31,25],[31,26],
[32,26],[33,26],[34,26],[35,26],[36,26],[37,26],[38,26],[39,26],[40,26],
[31,10],[32,10],[33,10],[34,10],[35,10],[36,10],[37,10],[38,10],[39,10],[40,10],
[32,13],[33,13],[34,13],[35,13],[36,13],[37,13],[38,13],[39,13],[40,13],
[31,6],[31,7],[31,8],[31,9],
[8,5],[9,5],[10,5],[11,5],[12,5],[13,5],[14,5],[15,5],[16,5],[17,5],[18,5],[19,5],[20,5],[21,5],[22,5],[23,5],[24,5],[25,5],[26,5],[27,5],[28,5],[29,5],[30,5],[31,5],
[8,6],[8,7],[8,8],[8,9],[8,10],[8,11],[8,12],[8,13],[8,14],
[29,8],[29,9],[29,10],[29,11],[29,12],[29,13],[29,14],[29,15],[29,16],[29,17],[29,18],[29,19],[29,20],[29,21],[29,22],[29,23],[29,24],
[10,24],[11,24],[12,24],[13,24],[14,24],[15,24],[16,24],[17,24],[18,24],[19,24],[20,24],[21,24],[22,24],[23,24],[24,24],[25,24],[26,24],[27,24],[28,24],
[10,8],[10,9],[10,10],[10,11],[10,12],[10,13],[10,14],[10,15],[10,16],[10,17],[10,18],[10,19],[10,20],[10,21],[10,22],[10,23],
[11,8],[12,8],[13,8],[14,8],[15,8],[16,8],[17,8],[18,8],[19,8],[20,8],[21,8],[22,8],[23,8],[24,8],[25,8],[26,8],[27,8],[28,8],
]



zote_precepts = [
    "戒律一：永远只打胜仗。 在输掉的战斗中，你不能获得任何战利品，更不能学到什么有用的东西。 所以，你要打赢所有的战斗，或者压根就不参与！",
    "戒律二：永远不要让别人嘲笑你。 傻瓜们会嘲笑一切，甚至会嘲笑比他们强大的人。 但是，你要注意，嘲笑声本身其实就是有害的！ 它会像疾病一样蔓延开来，不久之后，所有人都会开始嘲笑你。 所以，你需要做的是迅速根除它，以阻止其扩散。",
    "戒律三：永远要保证足够的休息。 战斗和冒险会消耗你的体力。 而只有当你休息的时候，你的体力才会恢复。 所以，你休息的时间越长就越强大。",
    "戒律四：学会忘记过去。 过去是痛苦的，回忆过去只会徒增伤悲。相反，你可以试着想想别的事情，比如未来或者美食等。",
    "戒律五：谨记用力量打败力量。你的对手很强大？没关系！只需要用比他们更强大的力量去对付他们，你很快就可以战胜他们。",
    "戒律六：学会把握你自己的命运。我们的长辈常教导我们说，我们的命运在我们出生之前就已注定，说实话，我不同意。",
    "戒律七：永远不要为死者悲伤。死后的世界将会是怎样？会变得更好还是更坏？没人知道，所以对于“死亡”这件事，我们无需悲伤，更无需欢喜。",
    "戒律八：学会独自旅行。你不要去依赖任何人，再者，也没人会永远忠诚。所以，请记住：没人会永远与你同行。",
    "戒律九：永远让自己的家保持干净整洁。你自己就是你最宝贵的财产——你的家是你的安身立命之所。所以，你要尽可能地保持它的干净与整洁。",
    "戒律十：请让你的武器时刻保持锋利无比。于我而言，我会让我的武器——“生命终结者”从始至终都锋利无比。这样的话，砍东西就会容易得多。",
    "戒律十一：谨防母亲的背叛。这一条不言自明。",
    "戒律十二：谨记让你的披风保持干燥。如果你的披风湿了，就尽快把它弄干。因为穿着湿漉漉的披风不仅会很不舒服，而且还容易生病。",
    "戒律十三：永远不要害怕。恐惧只会让你退缩。我知道直面恐惧需要付出巨大的努力。但是，直面恐惧的前提就是要先不害怕。",
    "戒律十四：永远尊重强者。尊重力量或者智慧，抑或二者都强于你的人。不要轻视或者嘲笑他们。",
    "戒律十五：谨记对付一个敌人只用一拳。一拳便足以对付一个敌人，再多就是浪费了。这样的话，只需记住自己出了几拳，你就知道已经打败多少敌人了。",
    "戒律十六：永远不要迟疑。一旦你决定了就去做，不要瞻前顾后。这种行事方式会让你终生受益，进而取得更多的成就。",
    "戒律十七：永远相信自己的力量。别人可能会怀疑你，但有一个人是永远值得你信赖的——你自己。相信自己的力量能让你的步伐永远稳健。",
    "戒律十八：学会在黑暗中寻求真理。这个戒律同样也不言自明。",
    "戒律十九：谨记只有尝试了，你才有可能成功。如果你想尝试去做什么，就一定要坚持做到。一件事，要么成功，要么失败！所以，你要不惜一切代价获得成功。",
    "戒律二十：绝不撒谎。和别人交流时，说真话会让人觉得你很谦恭，同时，也会使得整个谈话过程变得很高效。不过，你要当心，说真话很容易会让你树敌，但这也是你必须要承担的代价。",
    "戒律二十一：要时刻警惕周围的环境。别只顾着埋头走路！你也要学会抬头看路，免得被偷袭。",
    "戒律二十二：好男儿要志在四方。只要有机会，我就会离开我的家乡，到处寻名山、访高友。梨园虽好，但终究不是久留之所。要知道，“温柔乡”即是“英雄冢”。",
    "戒律二十三：要摸清敌人的软肋。你遇到的每一个敌人都有其软肋，比如他们的身上有伤或者正在酣睡等。你必须时刻保持警惕，并且仔细观察你的敌人，从而发现他们的软肋！",
    "戒律二十四：学会痛击敌人的软肋。一旦发现敌人的软肋，你就应对其发起猛烈地攻击。这样你就能很快地歼灭他们了。",
    "戒律二十五：学会隐藏自己的软肋。要知道你的敌人也会试图去摸清你的软肋，所以你必须藏好它们。那么最佳的藏法是什么呢？从来就没有软肋。",
    "戒律二十六：不要相信你的倒影。当你对着某些光亮的表面时，你可能会看到一张自己的脸。而且这张脸会模仿你的各个动作，看起来就和你一模一样，但请你不要因此而相信它。",
    "戒律二十七：要尽量多吃。吃饭时，能吃多少吃多少。这能让你获得足够多的能量，而且还间接地减少了吃饭的次数。",
    "戒律二十八：永远不要凝视黑暗。如果当你凝视黑暗而久久不见一物时，你的大脑就会开始流连于陈旧的记忆，而戒律四已经说过了，要学会忘记过去，避免在过去的记忆中无休止地纠缠。",
    "戒律二十九：要刻意训练你的方向感。在蜿蜒曲折的洞穴中旅行很容易迷路。而有一个好的方向感就像有一张神奇的地图在你的脑子里，这非常有用。",
    "戒律三十：永远不要轻信别人的诺言。诺言有时候并不是很可靠，因为许诺者经常会食言，所以，不要轻信它，尤其是爱情或者婚姻的诺言。",
    "戒律三十一：要注意个人卫生。要知道，在脏兮兮的地方呆得太久是会让你生病的。所以，如果去别人家里，请要求主人给你提供最高规格的卫生条件。",
    "戒律三十二：名字有其内在的力量。所有的名字都有其内在的力量，所以，当你在给某个事物起名字的时候，你其实就是在赋予它力量。比如，我就给我自己的骨钉取名为“生命终结者”。",
    "戒律三十三：永远不要向你的敌人献殷勤。向你的敌人献殷勤并不是什么美德！因为你的敌人不配得到你的尊重、仁慈和怜悯。",
    "戒律三十四：睡前不要吃东西。睡前吃东西首先不好消化，其次还影响休息，这已经是常识了。",
    "戒律三十五：上就是上，下就是下。如果在黑暗中摔倒的话，你很容易就会失去方向感，忘记哪条路是向上走的。所以，请记住这条戒律！",
    "戒律三十六：谨记蛋壳很容易破碎。这条戒律又是不言自明的。",
    "戒律三十七：永远只从别人那里借东西，自己的东西绝不外借。如果别人有借有还，那么到头来你什么也得不到。但是，如果你只借不还，那么你就会赚得钵丰盆满。",
    "戒律三十八：请警惕神秘的力量。在我们头上一直有一股神秘的力量将我们往下压。如果你在空中停留得太久的话，那么那股神秘的力量就会把你压进地里，进而让你丢掉性命。所以，你要当心啊！",
    "戒律三十九：学会快吃慢饮。我们的身体是一个十分脆弱的东西，所以补充能量的时候，你必须小心谨慎。吃饭时你可以尽量快一点，但喝水的时候你一定要慢一些。",
    "戒律四十：随心所欲，随心而动。过分地拘泥于规则反而会成为你的负担，有时候，你需要灵活变通，跟随自己的节奏。",
    "戒律四十一：学会分辨谎言。别人会经常撒谎，所以，你要尖锐地指出来，并且当面质疑他们，直到他们承认自己撒谎了。",
    "戒律四十二：永远不要做守财奴。有些人宁愿将钱带进棺材，也不愿花它们，这就是典型的守财奴。所以，你要及时行乐，能花的时候就花才是聪明人的做法，不然你就享受不到生命中的各种乐趣了。",
    "戒律四十三：永远不要宽恕别人。如果有人恳求你的原谅，比如你的兄弟，一定要拒绝。任何人都不配得到你的原谅，包括你的那个兄弟。",
    "戒律四十四：不要试图在水里呼吸。水是可以用来提神的，但如果你想试图在里面呼吸的话，你会窒息而死的。",
    "戒律四十五：谨记一个事物永远不可能变成另外一个事物。这条戒律应该是显而易见的，但总是有人试图指鹿为马，混淆视听。所以，你要小心啊！",
    "戒律四十六：谨记世界没你想象的那么大。年轻时，你认为天广地阔，这是很自然的。但不幸的是，世界实际上要小得多。这是我多年翻山越岭、跋山涉水后的感悟。",
    "戒律四十七：要打造属于你自己的武器。只有你自己知道你想要什么样的武器。在我在很小的时候，我就用壳木制作了一把骨钉——“生命终结者”。并且，它从未让我失望过，同样地，我也如此。",
    "戒律四十八：请小心火烛。火是一个可以肆意妄为的精灵。它能温暖你、照亮你，但如果靠得太近的话，它也会烧焦你。",
    "戒律四十九：谨记雕像毫无意义。不要去崇拜雕像！况且，从来就没有人为你我立像，那我们为什么还要关注这个玩意？",
    "戒律五十：不要痴迷于神秘。生活有时候会让我们一头雾水，满脸疑惑。此时，如果你不能立刻明白它背后所暗含的意义，那么就不要浪费时间去刨根究底了，大胆地继续前进就行。",
    "戒律五十一：谨记没有什么是无害的。如果有机会，这世界上的一切都会伤害到你，比如朋友、敌人、怪物和不平坦的道路等。所以，你要时刻怀有质疑精神。",
    "戒律五十二：谨防父亲的嫉妒。父亲们总是认为，正是由于他们创造了我们，所以我们必须为他们服务，并且决不能有超越他们的地方。如果你想开辟一条属于你自己的道路，就必须先战胜你的父亲，或者干脆离开他。",
    "戒律五十三：不要横刀夺爱。不管是谁，都会将自己的挚爱之物埋藏在内心深处。如果你不小心瞥见了它们，就要学会克制住想占为己有的冲动。因为横刀夺爱是不会给你带来任何幸福的。",
    "戒律五十四：如果你锁了什么东西，那么请把钥匙保管好。没有什么东西可以永远被锁起来，所以请保管好你的钥匙。因为，总有一天，你会回来取走你锁起来的东西的。",
    "戒律五十五：不要向任何人摧眉折腰。世界上总是有人会把自己的意志强加给别人。他们只会巧取豪夺，却还总无耻地声称你的食物、土地和身体，甚至你的思想都属于他们！所以，请记住：永远不要向他们屈服，更不要任他们摆布。",
    "戒律五十六：永远不要做梦。梦其实是一个很危险的东西，其本质是非你所有的奇怪的想法，并且还会潜入你的大脑。可是，如果你想单方面排斥它的话，又会惹来一身的病！所以，最好就像我一样不要做梦。",
    "戒律五十七：请遵守我说的所有戒律。最重要的是要把所有戒律都牢记在心，并且一丝不苟地遵守它们。包括这一条！",
]
